#+TITLE: Project Scratch

* Searcher
Change ~search_string~ value to search for a particular string.
        e.g. ~search_string="flowpose"~
Change ~excluded_dirs~ to exclude particular directories from grep search.
        e.g. ~excluded_dirs=(":!./logs/*" ":!./env/*")~
#+begin_src bash :results output
## ----------------------
search_string="grey"
excluded_dirs=(":!./logs/*" ":!./env/*")
## ----------------------

# Search for the file names
git grep -l $search_string -- ${excluded_dirs[@]}
# Provide a file count
echo -e "\nThere are $(git grep -l $search_string -- ${excluded_dirs[@]} | wc -l) files containing '${search_string}'"
#+end_src

#+RESULTS:
: demo.py
: utils.py
:
: There are 2 files containing 'grey'

